Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གཟུགས་མ་བཅིངས་མ་གྲོལ་བ་ཡིན་ནམ།
en: The venerable Pūrṇa­maitrāyaṇī­putra then addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, are physical forms neither fettered nor liberated?

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མ་བཅིངས་མ་གྲོལ་བ་ཡིན་ནམ། སྨྲས་པ།
en: Similarly, are feelings, perceptions, formative predispositions, and consciousness neither fettered nor liberated?”

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་ཏེ།
en: “Venerable Pūrṇa, that is the case!

source: གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Physical forms are neither fettered nor liberated.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་གང་པོས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གཟུགས་མ་བཅིངས་མ་གྲོལ་བ་གང་ཡིན།
en: Then the venerable Pūrṇa addressed the venerable Su­bhūti as follows: “Venerable Su­bhūti, what are those physical forms that are neither fettered nor liberated?

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མ་བཅིངས་མ་གྲོལ་བ་གང་ཡིན།
en: Similarly, what are the feelings, perceptions, formative predispositions, and consciousness that are neither fettered nor liberated?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་རྨི་ལམ་ལྟ་བུའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: “Venerable Pūrṇa, physical forms which resemble dreams are neither fettered nor liberated.

source: དེ་བཞིན་དུ་རྨི་ལམ་ལྟ་བུའི་ཚོར་བ་དང་། རྨི་ལམ་ལྟ་བུའི་འདུ་ཤེས་དང་། རྨི་ལམ་ལྟ་བུའི་འདུ་བྱེད་རྣམས་དང་། རྨི་ལམ་ལྟ་བུའི་རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Likewise, feelings which resemble dreams, perceptions which resemble dreams, formative predispositions which resemble dreams, and consciousness which resembles dreams are neither fettered nor liberated.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། བྲག་ཅ་ལྟ་བུའི་གཟུགས་དང་། རྣམ་པར་ཤེས་པའི་བར་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: In the same vein, physical forms, which resemble echoes, and [the other aggregates], up to and including consciousness, which resembles echoes, are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, Venerable Pūrṇa, physical forms that resemble optical aberrations, magical displays, mirages, and phantoms are neither fettered nor liberated.

source: དེ་བཞིན་དུ་སྤྲུལ་པ་ལྟ་བུའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, feelings, perceptions, formative predispositions, and consciousness that resemble phantoms [and the like] are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་འདས་པའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་འདས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Venerable Pūrṇa, physical forms of the past are neither fettered nor liberated; similarly, feelings, perceptions, formative predispositions, and consciousness of the past are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་མ་འོངས་པའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་མ་འོངས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, Venerable Pūrṇa, physical forms of the future are neither fettered nor liberated; and similarly, feelings, perceptions, formative predispositions, and consciousness of the future are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ད་ལྟར་བྱུང་བའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ད་ལྟར་བྱུང་བའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, Venerable Pūrṇa, physical forms of the present are neither fettered nor liberated; and similarly, feelings, perceptions, formative predispositions, and consciousness of the present are neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། མེད་པའི་ཕྱིར་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: If you ask why, physical forms are neither fettered nor liberated because they are non-existent.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, consciousness and all [the other aggregates] are neither fettered nor liberated because feelings, perceptions, formative predispositions, and consciousness are non-existent.

source: དེ་བཞིན་དུ་གཟུགས་དབེན་པའི་ཕྱིར། གཟུགས་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, physical forms are all neither fettered nor liberated because physical forms are void.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དབེན་པའི་ཕྱིར་དང་། རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, consciousness and all [the other aggregates] are neither fettered nor liberated because feelings, perceptions, formative predispositions, and consciousness are void.

source: དེ་བཞིན་དུ་གཟུགས་སྐྱེ་བ་མེད་པའི་ཕྱིར། གཟུགས་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, physical forms are all neither fettered nor liberated because physical forms are non-arising.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་སྐྱེ་བ་མེད་པའི་ཕྱིར་དང་། རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་པའི་ཕྱིར། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, consciousness and all [the other aggregates] are neither fettered nor liberated because feelings, perceptions, formative predispositions, and consciousness are non-arising.

source: དེ་བཞིན་དུ་གཟུགས་འགག་པ་མེད་པའི་ཕྱིར། གཟུགས་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, physical forms are all neither fettered nor liberated because physical forms are unceasing.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་འགག་པ་མེད་པའི་ཕྱིར་དང་། རྣམ་པར་ཤེས་པ་འགག་པ་མེད་པའི་ཕྱིར། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, consciousness and all [the other aggregates] are neither fettered nor liberated because feelings, perceptions, formative predispositions, and consciousness are unceasing.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་གཟུགས་དགེ་བ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ཚོར་བ་དགེ་བ་དང་། འདུ་ཤེས་དགེ་བ་དང་། འདུ་བྱེད་དགེ་བ་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དགེ་བ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: “Likewise, Venerable Pūrṇa, virtuous physical forms are neither fettered nor liberated; similarly, virtuous feelings, virtuous perceptions, virtuous formative predispositions, and virtuous consciousness are neither fettered nor liberated.

source: དེ་བཞིན་དུ་གཟུགས་མི་དགེ་བ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་མི་དགེ་བ་རྣམས་དང་། རྣམ་པར་ཤེས་པ་མི་དགེ་བ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Likewise, non-virtuous physical forms are neither fettered nor liberated, and similarly, non-virtuous feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: དེ་བཞིན་དུ་གཟུགས་ལུང་དུ་མ་བསྟན་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་ལུང་དུ་མ་བསྟན་པ་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལུང་དུ་མ་བསྟན་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Likewise, indeterminate physical forms are neither fettered nor liberated, and similarly, indeterminate feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: འཇིག་རྟེན་པའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་འཇིག་རྟེན་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། འཇིག་རྟེན་པའི་རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: In the same vein, mundane physical forms are neither fettered nor liberated, and similarly, mundane feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: འཇིག་རྟེན་ལས་འདས་པའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་འཇིག་རྟེན་ལས་འདས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། འཇིག་རྟེན་ལས་འདས་པའི་རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Supramundane physical forms are neither fettered nor liberated, and similarly, supramundane feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: གཟུགས་ཟག་པ་དང་བཅས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་ཟག་པ་དང་བཅས་པ་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཟག་པ་དང་བཅས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Contaminated physical forms are neither fettered nor liberated, and similarly, contaminated feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: གཟུགས་ཟག་པ་མེད་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་ཟག་པ་མེད་པ་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཟག་པ་མེད་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Uncontaminated physical forms are neither fettered nor liberated, and similarly, uncontaminated feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: གཟུགས་མེད་པའི་ཕྱིར་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་མེད་པའི་ཕྱིར་དང་། རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར་གཟུགས་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: If you ask why physical forms are neither fettered nor liberated, and similarly, why feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated, it is because physical forms are non-existent, and because feelings, perceptions, formative predispositions, and consciousness are non-existent.

source: འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་གཟུགས་དང་རྣམ་པར་ཤེས་པའི་བར་དུ་དབེན་པའི་ཕྱིར་དང་། གཟུགས་དང་རྣམ་པར་ཤེས་པའི་བར་དུ་སྐྱེ་བ་མེད་པའི་ཕྱིར་དང་། གཟུགས་དང་རྣམ་པར་ཤེས་པའི་བར་དུ་འགག་པ་མེད་པའི་ཕྱིར་དང་། གཟུགས་དང་རྣམ་པར་ཤེས་པའི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའི་ཕྱིར་དང་། གཟུགས་དང་དེ་བཞིན་དུ་རྣམ་པར་ཤེས་པའི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, physical forms and [the other aggregates], up to and including consciousness, are neither fettered nor liberated because they are void, because they are non-arising and unceasing, and because they are not fettered and not bound.

source: ཚེ་དང་ལྡན་པ་གང་པོ་ཆོས་ཐམས་ཅད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: “Venerable Pūrṇa, all things are neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: If you ask why, all things are neither fettered nor liberated because all things are non-existent.

source: དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་དབེན་པའི་ཕྱིར་དང་སྐྱེ་བ་མེད་པའི་ཕྱིར་དང་། འགག་པ་མེད་པའི་ཕྱིར་དང་། མ་བཅིངས་པའི་ཕྱིར་དང་། མ་གྲོལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, all things are neither fettered nor liberated because all things are void, because they are non-arising, because they are unceasing, because they are not fettered, and because they are not bound.

source: ཚེ་དང་ལྡན་པ་གང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Venerable Pūrṇa, the transcendent perfection of generosity is also neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, Venerable Pūrṇa, the transcendent perfection of ethical discipline, the transcendent perfection of tolerance, the transcendent perfection of perseverance, the transcendent perfection of meditative concentration, and the transcendent perfection of wisdom are also neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: If you ask why, the transcendent perfection of generosity is neither fettered nor liberated because it is non-existent.

source: དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, the other transcendent perfections, up to and including the transcendent perfection of wisdom, are neither fettered nor liberated because they are non-existent.”

source: ཚེ་དང་ལྡན་པ་གང་པོ་ནང་སྟོང་པ་ཉིད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡང་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་བཞིན་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པའི་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་།
en: “Venerable Pūrṇa, the emptiness of internal phenomena is also neither fettered nor liberated, and similarly, the other aspects of emptiness, up to and including the emptiness of the essential nature of non-entities, are neither fettered nor liberated.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དག་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Similarly, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the five faculties, the five powers, the seven aspects of enlightenment, the noble eightfold path, the three gateways to liberation, the ten powers of the tathāgatas, and in the same vein, [all other attributes], up to and including the eighteen distinct qualities of the buddhas, are also neither fettered nor liberated.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དབེན་པ་ཉིད་ཀྱི་ཕྱིར་དང་། མ་བཅིངས་པ་ཉིད་ཀྱི་ཕྱིར་དང་། མ་གྲོལ་བ་ཉིད་ཀྱི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: If you ask why, those [attributes], up to and including the eighteen distinct qualities of the buddhas, are neither fettered nor liberated because they themselves are non-existent, because they themselves are void, because they themselves are unfettered, and because they themselves are unliberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: Venerable Pūrṇa, enlightenment too is neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། དབེན་པ་ཉིད་ཀྱི་ཕྱིར་དང་།
en: Similarly, Venerable Pūrṇa, the understanding of all phenomena, the understanding of the aspects of the path, omniscience, and the bodhisattvas are also neither fettered nor liberated.

source: སྐྱེ་བ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། འགག་པ་མེད་པ་ཉིད་ཀྱི་ཕྱིར། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་བར་དུ་ཡང་མ་བཅིངས་མ་གྲོལ་བའོ། །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་ཉིད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་།
en: If you ask why, they are neither fettered nor liberated because they themselves are non-existent, because they themselves are void, because they themselves are non-arising, because they themselves are non-ceasing, and so on, even up to the attainment of buddhahood.

source: ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། འདུས་མ་བྱས་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདུས་མ་བྱས་ཀྱི་བར་དུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་།
en: “Venerable Pūrṇa, the real nature, the inalienable real nature, reality, the expanse of reality, the abiding nature of phenomena, the maturity [of the bodhisattvas], the finality of existence, and [other] unconditioned phenomena are also neither fettered nor liberated.

source: དབེན་པ་ཉིད་ཀྱི་ཕྱིར་དང་། སྐྱེ་བ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། འགག་པ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། མ་བཅིངས་པ་ཉིད་ཀྱི་ཕྱིར་དང་། མ་གྲོལ་བ་ཉིད་ཀྱི་ཕྱིར་འདུས་མ་བྱས་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའོ། །
en: If you ask why, these phenomena, up to and including unconditioned phenomena, are neither fettered nor liberated because they are themselves non-existent, because they are themselves void, because they are themselves non-arising, because they are themselves unceasing, because they are themselves not fettered, and because they are themselves not liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་བཅིངས་མ་གྲོལ་བ་དང་།
en: “Venerable Pūrṇa, in this regard, the transcendent perfection of generosity possessed by great bodhisattva beings is neither fettered nor liberated.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: The other transcendent perfections, up to and including the transcendent perfection of wisdom, and [the attainments], up to and including omniscience, are also neither fettered nor liberated.

source: ལེའུ་གོང་མར་ཇི་སྐད་བསྟན་པ་དེ་ཁོ་ན་བཞིན་དུ་སྦྱར་བར་བྱའོ། །
en: The same refrain should be applied here, as has been indicated in the preceding [part of this] chapter.

source: དེ་མ་བཅིངས་མ་གྲོལ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: “They abide in the transcendent perfection of generosity that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ལ་གནས།
en: They abide in the [other transcendent perfections], up to and including the transcendent perfection of wisdom, which are neither fettered nor liberated.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། མ་བཅིངས་མ་གྲོལ་བའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་གནས་ཏེ།
en: In the same vein, they abide in [the attainments], up to and including omniscience, which are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: They bring to maturity sentient beings who are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བ་ཁོ་ནའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །
en: They refine fields that are exclusively neither fettered nor liberated.

source: དེ་མ་བཅིངས་མ་གྲོལ་བ་ཁོ་ནའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་དོ། །
en: They venerate the emanations of the lord buddhas who are exclusively neither fettered nor liberated.

source: དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་མ་བཅིངས་མ་གྲོལ་བ་ཁོ་ནའི་ཆོས་ཀྱང་ཉན་ཏོ། །
en: They also listen to the doctrines delivered by those emanations of the lord buddhas, which are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །
en: They will never be separated from those emanations of the lord buddhas who are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་མངོན་པར་ཤེས་པ་རྣམས་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །
en: They will never be separated from the extrasensory powers that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་མིག་ལྔ་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །མ་བཅིངས་མ་གྲོལ་བའི་གཟུངས་རྣམས་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །
en: They will never be separated from the five eyes that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ཏིང་ངེ་འཛིན་རྣམས་དང་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །
en: They will never be separated from the mnemonic incantations that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མངོན་པར་སྒྲུབ་བོ། །
en: They will indeed actualize the understanding of all phenomena that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱང་སྐྱེད་པར་བྱེད་དོ། །
en: They will develop the understanding of the aspects of the path that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: They will attain manifestly perfect buddhahood in omniscience that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་སྐོར་བར་འགྱུར་རོ། །
en: They will turn the wheel of the sacred doctrine that is neither fettered nor liberated.

source: དེ་མ་བཅིངས་མ་གྲོལ་བའི་སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་པོ་དག་ལ་སྦྱོར་བར་བྱེད་དོ། །
en: They will consolidate in the three vehicles sentient beings who are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་བཅིངས་མ་གྲོལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གིས་མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Venerable Pūrṇa, so it is that great bodhisattva beings will attain manifestly perfect buddhahood with respect to all things, by means of the six transcendent perfections which are neither fettered nor liberated.

source: ཆོས་ཐམས་ཅད་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཞི་བ་ཉིད་ཀྱི་ཕྱིར་དང་། དབེན་པ་ཉིད་ཀྱི་ཕྱིར་དང་། སྐྱེ་བ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་དང་། འགག་པ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །
en: This is because all things are themselves non-existent, because they themselves are calm, because they themselves are void, because they themselves are non-arising, and because they themselves are unceasing.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟ་བུ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མ་བཅིངས་མ་གྲོལ་བའི་གོ་ཆ་ཆེན་པོ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Venerable Pūrṇa, one should know that it is in this way that great bodhisattva beings possess the great armor which is neither fettered nor liberated.”

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གོ་ཆ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། མངོན་པར་ཤེས་པ་དྲུག་པོ་དག་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཡིན་ནོ། །དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: [Then the Lord Buddha said], “Moreover, Su­bhūti, the great armor of great bodhisattva beings entails the refinement of the six extrasensory powers.

source: རྫུ་འཕྲུལ་གྱི་བྱ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ལྷའི་མིག་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ལྷའི་རྣ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ཕ་རོལ་གྱི་སེམས་ཀྱི་རྣམ་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་།
en: If you ask what these six are, they comprise (1) the extrasensory power realizing knowledge of miraculous activities, (2) the extrasensory power realizing knowledge of divine clairvoyance, (3) the extrasensory power realizing knowledge of divine clairaudience, (4) the extrasensory power realizing knowledge of the minds of others, (5) the extrasensory power realizing knowledge of the recollection of past lives, and (6) the extrasensory power realizing knowledge of the cessation of contaminants.

source: ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་དེ། རབ་འབྱོར་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མངོན་པར་ཤེས་པ་དྲུག་པོ་དག་ཡིན་ནོ། །
en: Su­bhūti, these are the six extrasensory powers of great bodhisattva beings.

source: རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྫུ་འཕྲུལ་གྱི་བྱ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ནས།
en: “Su­bhūti, if you ask what constitutes the refinement of the extrasensory power realizing knowledge of miraculous activities which great bodhisattva beings have—Su­bhūti, great bodhisattva beings, abiding in the transcendent perfection of wisdom, experience many facets of miraculous ability.

source: རྫུ་འཕྲུལ་གྱི་བྱ་བ་རྣམ་པ་དུ་མ་མྱོང་བར་བྱེད་དེ། དེས་འདི་ཡང་གཡོ་བར་བྱེད་དོ། །
en: They may cause this very [earth] to shake.

source: དེ་བཞིན་དུ་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར་བ་དང་། མང་པོར་གྱུར་ནས་ཀྱང་གཅིག་ཏུ་འགྱུར་བ་དང་།
en: Similarly, having been singular [in form], they can become multiple, and having been multiple [in form], they can become singular.

source: དེ་བཞིན་དུ་སྣང་བར་འགྱུར་ཞིང་། མི་སྣང་བར་འགྱུར་བ་ཡང་མྱོང་བར་བྱེད་དོ། །
en: Similarly, they may experience themselves as visible and as invisible.

source: རྩིག་པ་ལ་ཡང་ཐད་ཀར་འགྲོའོ། །
en: They can move directly through walls.

source: ར་བ་ལ་ཡང་ཐད་ཀར་འགྲོའོ། །
en: They can move directly through enclosures.

source: རི་ལ་ཡང་མི་ཐོགས་པར་ཐད་ཀར་འགྲོ་སྟེ། དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བ་བཞིན་ནོ། །
en: They can move directly through mountains, without impediment, as if they were moving, for example, through space.

source: ནམ་མཁའ་ལ་ཡང་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ། །
en: They can also move through space, sitting with their legs crossed, just like a bird on the wing.

source: ས་ལ་ཡང་སྟེང་དུ་འབྱུང་བ་དང་། བྱིའུ་ཟུལ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ། །
en: They can hover above the earth and levitate, as if they were in water.
